package com.napi.napi;


import static com.napi.napi.RequestCode.films;

/**
 * Created by SRoma on 12.03.2017.
 */


public class Films_Library {



    public static void main() {

       String a_OPERATOR = "Оператор";
       String a_HUDOZNIK = "Художник";




        films[0][0] = "Звёздные войны: Эпизод 4 – Новая надежда";
        films[0][1] = "0:17:41";
        films[0][2] = String.valueOf(R.drawable.activity_settings_1_photo);
        films[0][3] = "1977";
        films[0][4] = "США";
        films[0][5] = "Джордж Лукас";
        films[0][6] = "Джордж Лукас";
        films[0][7] = "Гари Кертц, Джордж Лукас, Рик МакКаллум";
        films[0][8] = a_OPERATOR;
        films[0][9] = "Гилберт Тейлор";
        films[0][10] = "Джон Уильямс";
        films[0][11] = "фантастика, фэнтези, боевик, приключения";
        films[0][12] = "Татуин. Планета-пустыня. Уже постаревший рыцарь Джедай Оби Ван Кеноби спасает молодого Люка Скайуокера, когда тот пытается отыскать пропавшего дроида. С этого момента Люк осознает свое истинное назначение: он один из рыцарей Джедай. В то время как гражданская война охватила галактику, а войска повстанцев ведут бои против сил злого Императора, к Люку и Оби Вану присоединяется отчаянный пилот-наемник Хан Соло, и в сопровождении двух дроидов, R2D2 и C-3PO, этот необычный отряд отправляется на поиски предводителя повстанцев — принцессы Леи. Героям предстоит отчаянная схватка с устрашающим Дартом Вейдером — правой рукой Императора и его секретным оружием — «Звездой Смерти».";

        films[1][0] = "Король Лев";
        films[1][1] = "0:15:10";
        films[1][2] = String.valueOf(R.drawable.activity_settings_2_photo);
        films[1][3] = "1994";
        films[1][4] = "США";
        films[1][5] = "Роджер Аллерс, Роб Минкофф";
        films[1][6] = "Ирен Меччи, Джонатан Робертс, Линда Вулвертон";
        films[1][7] = "Дон Хан, Элис Дьюи, Сара МакАртур";
        films[1][8] = a_HUDOZNIK;
        films[1][9] = "Крис Сандерс, Энди Гэскилл";
        films[1][10] = "Ханс Циммер";
        films[1][11] = "мультфильм, мюзикл, драма, приключения, семейный";
        films[1][12] = "У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти.Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём.";

        films[2][0] = "Гарри Поттер и философский камень";
        films[2][1] = "0:20:55";
        films[2][2] = String.valueOf(R.drawable.activity_settings_3_photo);
        films[2][3] = "2001";
        films[2][4] = "Великобритания, США";
        films[2][5] = "Крис Коламбус";
        films[2][6] = "Стивен Кловз, Дж.К. Роулинг";
        films[2][7] = "Дэвид Хейман, Тодд Арноу, Майкл Барнатан";
        films[2][8] = a_OPERATOR;
        films[2][9] = "Джон Сил";
        films[2][10] = "Джон Уильямс";
        films[2][11] = "фэнтези, приключения, семейный";
        films[2][12] = "Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: его родители умерли, едва ему исполнился год, а от дяди и тётки, взявших сироту на воспитание, достаются лишь тычки да подзатыльники. Но в одиннадцатый день рождения Гарри всё меняется. Странный гость, неожиданно появившийся на пороге, приносит письмо, из которого мальчик узнаёт, что на самом деле он волшебник и принят в Хогвартс — школу магии. А уже через пару недель Гарри будет мчаться в поезде Хогвартс-экспресс навстречу новой жизни, где его ждут невероятные приключения, верные друзья и самое главное — ключ к разгадке тайны смерти его родителей.";



    }


}

